tutorialsDyM/2DOscillatoryFlowCylinder/constant/turbulenceProperties.b
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.4.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      turbulenceProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

simulationType  RAS;

RAS{
//RASModel        twophasekEpsilon;
RASModel        twophasekOmega;
//RASModel        twophasekOmegaEps;

turbulence      on;
printCoeffs     on;

twophasekOmega2006Coeffs
{
    popeCorrection  false;
}
}



// ************************************************************************* //

